<?php
// 1 задание
    while ($i<=100) {
    if ($i % 3 == 0)  echo $i . ", " ;
    $i++;
};
echo "<br/><br/>";

// 2 задание
$i = 0;
$c = 10;
do {
    if ($i !== 0) {
        if ($i % 2 == 0) echo "$i - чётное число.<br/>";
        else echo "$i - нечётное число.<br/>";
    } else {echo "$i - ноль.<br/>";};
    $i++;
} while ($i <= $c);

echo "<br/><br/>";

// 3 задание

$region['Челябинская'] = [
    1 => 'Челябинск',
    2 => 'Магнитогорск',
    3 => 'Миасс',
];
$region['Татарстан'] = [
    1 => 'Казань',
    2 => 'Набережные Челны',
    3 => 'Альметьевск',
];
$region['Саратовская'] = [
    1 => 'Саратов',
    2 => 'Балаково',
    3 => 'Маркс',
];
foreach ($region as $name => $value) {
    echo "$name: ";
    foreach ($value as $sity) echo "$sity, ";
    echo "<br/>";
};

// 4 задание